<?php
class Benana_Automation_Address {
    public static function get_provinces() {
        return array(
            '01' => 'آذربایجان شرقی',
            '02' => 'آذربایجان غربی',
            '03' => 'اردبیل',
            '04' => 'اصفهان',
            '05' => 'البرز',
            '06' => 'ایلام',
            '07' => 'بوشهر',
            '08' => 'تهران',
            '09' => 'چهارمحال و بختیاری',
            '10' => 'خراسان جنوبی',
            '11' => 'خراسان رضوی',
            '12' => 'خراسان شمالی',
            '13' => 'خوزستان',
            '14' => 'زنجان',
            '15' => 'سمنان',
            '16' => 'سیستان و بلوچستان',
            '17' => 'فارس',
            '18' => 'قزوین',
            '19' => 'قم',
            '20' => 'کردستان',
            '21' => 'کرمان',
            '22' => 'کرمانشاه',
            '23' => 'کهگیلویه و بویراحمد',
            '24' => 'گلستان',
            '25' => 'گیلان',
            '26' => 'لرستان',
            '27' => 'مازندران',
            '28' => 'مرکزی',
            '29' => 'هرمزگان',
            '30' => 'همدان',
            '31' => 'یزد',
        );
    }

    public static function get_cities() {
        return array(
            '01' => array(
                '0101' => 'تبریز',
                '0102' => 'مراغه',
                '0103' => 'مرند',
            ),
            '02' => array(
                '0201' => 'ارومیه',
                '0202' => 'خوی',
                '0203' => 'میاندوآب',
            ),
            '04' => array(
                '0401' => 'اصفهان',
                '0402' => 'کاشان',
                '0403' => 'نجف‌آباد',
            ),
            '08' => array(
                '0801' => 'تهران',
                '0802' => 'شمیرانات',
                '0803' => 'پردیس',
            ),
            '17' => array(
                '1701' => 'شیراز',
                '1702' => 'کازرون',
                '1703' => 'مرودشت',
            ),
            '21' => array(
                '2101' => 'کرمان',
                '2102' => 'رفسنجان',
                '2103' => 'جیرفت',
            ),
            '27' => array(
                '2701' => 'ساری',
                '2702' => 'بابل',
                '2703' => 'قائم‌شهر',
            ),
        );
    }

    public static function get_city_name( $province_id, $city_id ) {
        $cities = self::get_cities();
        if ( isset( $cities[ $province_id ][ $city_id ] ) ) {
            return $cities[ $province_id ][ $city_id ];
        }

        return '';
    }
}
